; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-79)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 - objective)
 (:init 
    (at_lander general waypoint4)
    (at rover1 waypoint2)
    (at rover2 waypoint6)
    (at rover3 waypoint4)
    (at rover4 waypoint1)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover4)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint6)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint9)
    (visible waypoint2 waypoint4)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint8)
    (visible waypoint2 waypoint1)
    (visible waypoint2 waypoint7)
    (visible waypoint6 waypoint5)
    (visible waypoint9 waypoint3)
    (visible waypoint4 waypoint2)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint9)
    (visible waypoint5 waypoint6)
    (visible waypoint7 waypoint2)
    (visible waypoint8 waypoint2)
    (visible waypoint3 waypoint2)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint5 waypoint8)
    (visible waypoint8 waypoint5)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint8)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover1 waypoint2 waypoint7)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint9 waypoint3)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint3 waypoint9)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint7 waypoint2)
    (can_traverse rover1 waypoint8 waypoint2)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint2 waypoint7)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint9 waypoint3)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint3 waypoint9)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint7 waypoint2)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint8)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint9 waypoint3)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint3 waypoint9)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint7 waypoint2)
    (can_traverse rover3 waypoint8 waypoint2)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover4 waypoint2 waypoint4)
    (can_traverse rover4 waypoint1 waypoint2)
    (can_traverse rover4 waypoint2 waypoint8)
    (can_traverse rover4 waypoint2 waypoint1)
    (can_traverse rover4 waypoint2 waypoint7)
    (can_traverse rover4 waypoint6 waypoint5)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint4 waypoint2)
    (can_traverse rover4 waypoint2 waypoint3)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint5 waypoint6)
    (can_traverse rover4 waypoint7 waypoint2)
    (can_traverse rover4 waypoint8 waypoint2)
    (can_traverse rover4 waypoint3 waypoint2)
    (can_traverse rover4 waypoint2 waypoint5)
    (can_traverse rover4 waypoint5 waypoint2)
    (calibration_target camera1 objective1)
    (on_board camera1 rover4)
    (supports camera1 low_res)
    (supports camera1 high_res)
    (calibration_target camera2 objective2)
    (on_board camera2 rover1)
    (supports camera2 low_res)
    (supports camera2 colour)
    (calibration_target camera3 objective7)
    (on_board camera3 rover1)
    (supports camera3 low_res)
    (supports camera3 colour)
    (calibration_target camera4 objective3)
    (on_board camera4 rover4)
    (supports camera4 colour)
    (visible_from objective1 waypoint9)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint2)
    (visible_from objective3 waypoint8)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint7)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint5)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint6)
    (visible_from objective5 waypoint8)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint6)
    (visible_from objective6 waypoint6)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint9)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint2)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint4)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint8)
    (visible_from objective8 waypoint1)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint9))
 (:goal (and 
(communicated_soil_data waypoint6)
(communicated_soil_data waypoint9)
(communicated_soil_data waypoint2)
(communicated_rock_data waypoint6)
(communicated_rock_data waypoint9)
(communicated_rock_data waypoint4)
(communicated_image_data objective1 low_res)
(communicated_image_data objective6 high_res)
(communicated_image_data objective3 colour)
(communicated_image_data objective4 colour)
(communicated_image_data objective8 high_res)
(communicated_image_data objective3 high_res)
(communicated_image_data objective5 colour)
(communicated_image_data objective2 high_res)
(communicated_image_data objective1 high_res)
(communicated_image_data objective8 colour)
(communicated_image_data objective4 low_res)
(communicated_image_data objective7 high_res)
))
)

; plan
1. (navigate rover4 waypoint1 waypoint2)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint2)
   goals met: 0 of 18
2. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 0 of 18
3. (take_image rover4 waypoint2 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective1 high_res)
   goals met: 0 of 18
4. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 0 of 18
5. (take_image rover4 waypoint2 objective2 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective2 high_res)
   goals met: 0 of 18
6. (communicate_image_data rover4 general objective2 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective2 high_res)
   goals met: 1 of 18
7. (communicate_image_data rover4 general objective1 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective1 high_res)
   goals met: 2 of 18
8. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 2 of 18
9. (take_image rover4 waypoint2 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective3 high_res)
   goals met: 2 of 18
10. (communicate_image_data rover4 general objective3 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective3 high_res)
   goals met: 3 of 18
11. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 3 of 18
12. (take_image rover4 waypoint2 objective7 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective7 high_res)
   goals met: 3 of 18
13. (communicate_image_data rover4 general objective7 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective7 high_res)
   goals met: 4 of 18
14. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 4 of 18
15. (take_image rover4 waypoint2 objective8 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective8 high_res)
   goals met: 4 of 18
16. (calibrate rover4 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover4)
   goals met: 4 of 18
17. (navigate rover4 waypoint2 waypoint5)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint5)
   goals met: 4 of 18
18. (navigate rover4 waypoint5 waypoint6)
   deleted: (at rover4 waypoint5)
   added: (at rover4 waypoint6)
   goals met: 4 of 18
19. (take_image rover4 waypoint6 objective6 camera1 high_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective6 high_res)
   goals met: 4 of 18
20. (navigate rover4 waypoint6 waypoint5)
   deleted: (at rover4 waypoint6)
   added: (at rover4 waypoint5)
   goals met: 4 of 18
21. (communicate_image_data rover4 general objective8 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective8 high_res)
   goals met: 5 of 18
22. (communicate_image_data rover4 general objective6 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective6 high_res)
   goals met: 6 of 18
23. (sample_rock rover2 rover2store waypoint6)
   deleted: (empty rover2store) (at_rock_sample waypoint6)
   added: (have_rock_analysis rover2 waypoint6) (full rover2store)
   goals met: 6 of 18
24. (navigate rover2 waypoint6 waypoint5)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint5)
   goals met: 6 of 18
25. (navigate rover2 waypoint5 waypoint2)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint2)
   goals met: 6 of 18
26. (communicate_rock_data rover2 general waypoint6 waypoint2 waypoint4)
   added: (communicated_rock_data waypoint6)
   goals met: 7 of 18
27. (navigate rover2 waypoint2 waypoint3)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint3)
   goals met: 7 of 18
28. (navigate rover2 waypoint3 waypoint9)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint9)
   goals met: 7 of 18
29. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 7 of 18
30. (sample_rock rover2 rover2store waypoint9)
   deleted: (empty rover2store) (at_rock_sample waypoint9)
   added: (have_rock_analysis rover2 waypoint9) (full rover2store)
   goals met: 7 of 18
31. (navigate rover2 waypoint9 waypoint3)
   deleted: (at rover2 waypoint9)
   added: (at rover2 waypoint3)
   goals met: 7 of 18
32. (navigate rover2 waypoint3 waypoint2)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint2)
   goals met: 7 of 18
33. (navigate rover2 waypoint2 waypoint4)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint4)
   goals met: 7 of 18
34. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 7 of 18
35. (sample_rock rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover2 waypoint4) (full rover2store)
   goals met: 7 of 18
36. (navigate rover2 waypoint4 waypoint2)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint2)
   goals met: 7 of 18
37. (communicate_rock_data rover2 general waypoint4 waypoint2 waypoint4)
   added: (communicated_rock_data waypoint4)
   goals met: 8 of 18
38. (communicate_rock_data rover2 general waypoint9 waypoint2 waypoint4)
   added: (communicated_rock_data waypoint9)
   goals met: 9 of 18
39. (calibrate rover1 camera2 objective2 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 9 of 18
40. (navigate rover1 waypoint2 waypoint3)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint3)
   goals met: 9 of 18
41. (navigate rover1 waypoint3 waypoint9)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint9)
   goals met: 9 of 18
42. (sample_soil rover1 rover1store waypoint9)
   deleted: (empty rover1store) (at_soil_sample waypoint9)
   added: (full rover1store) (have_soil_analysis rover1 waypoint9)
   goals met: 9 of 18
43. (navigate rover1 waypoint9 waypoint3)
   deleted: (at rover1 waypoint9)
   added: (at rover1 waypoint3)
   goals met: 9 of 18
44. (take_image rover1 waypoint3 objective4 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective4 colour)
   goals met: 9 of 18
45. (navigate rover1 waypoint3 waypoint2)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint2)
   goals met: 9 of 18
46. (communicate_image_data rover1 general objective4 colour waypoint2 waypoint4)
   added: (communicated_image_data objective4 colour)
   goals met: 10 of 18
47. (communicate_soil_data rover1 general waypoint9 waypoint2 waypoint4)
   added: (communicated_soil_data waypoint9)
   goals met: 11 of 18
48. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 11 of 18
49. (calibrate rover4 camera4 objective3 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 11 of 18
50. (take_image rover4 waypoint5 objective3 camera4 colour)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective3 colour)
   goals met: 11 of 18
51. (communicate_image_data rover4 general objective3 colour waypoint5 waypoint4)
   added: (communicated_image_data objective3 colour)
   goals met: 12 of 18
52. (calibrate rover1 camera2 objective2 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 12 of 18
53. (take_image rover1 waypoint2 objective1 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 12 of 18
54. (communicate_image_data rover1 general objective1 low_res waypoint2 waypoint4)
   added: (communicated_image_data objective1 low_res)
   goals met: 13 of 18
55. (calibrate rover1 camera2 objective2 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 13 of 18
56. (take_image rover1 waypoint2 objective5 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective5 colour)
   goals met: 13 of 18
57. (communicate_image_data rover1 general objective5 colour waypoint2 waypoint4)
   added: (communicated_image_data objective5 colour)
   goals met: 14 of 18
58. (calibrate rover1 camera2 objective2 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 14 of 18
59. (take_image rover1 waypoint2 objective8 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective8 colour)
   goals met: 14 of 18
60. (communicate_image_data rover1 general objective8 colour waypoint2 waypoint4)
   added: (communicated_image_data objective8 colour)
   goals met: 15 of 18
61. (sample_soil rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_soil_sample waypoint2)
   added: (full rover1store) (have_soil_analysis rover1 waypoint2)
   goals met: 15 of 18
62. (navigate rover1 waypoint2 waypoint5)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint5)
   goals met: 15 of 18
63. (communicate_soil_data rover1 general waypoint2 waypoint5 waypoint4)
   added: (communicated_soil_data waypoint2)
   goals met: 16 of 18
64. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 16 of 18
65. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 16 of 18
66. (sample_soil rover1 rover1store waypoint6)
   deleted: (empty rover1store) (at_soil_sample waypoint6)
   added: (full rover1store) (have_soil_analysis rover1 waypoint6)
   goals met: 16 of 18
67. (calibrate rover1 camera3 objective7 waypoint6)
   added: (calibrated camera3 rover1)
   goals met: 16 of 18
68. (take_image rover1 waypoint6 objective4 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 low_res)
   goals met: 16 of 18
69. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 16 of 18
70. (communicate_image_data rover1 general objective4 low_res waypoint5 waypoint4)
   added: (communicated_image_data objective4 low_res)
   goals met: 17 of 18
71. (communicate_soil_data rover1 general waypoint6 waypoint5 waypoint4)
   added: (communicated_soil_data waypoint6)
   goals met: 18 of 18
